![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-01_59.png?raw=true)
топология сети

# Шаг 1: Настройка коммутатора Switch3
```
Switch(config-vlan)#exit
Switch(config)#vlan 4
Switch(config-vlan)#name Inzenerni
Switch(config-vlan)#ex
Switch(config)#vlan 71
Switch(config-vlan)#name Manager
Switch(config-vlan)#ex
Switch(config)#vlan 84
Switch(config-vlan)#name Rukowod
Switch(config-vlan)#ex
Switch(config)#vlan 86
Switch(config-vlan)#name Stazer
Switch(config-vlan)#ex
Switch(config)#vlan 999
Switch(config-vlan)#name Native_VLAN
Switch(config-vlan)#exit
Switch#wr memory
Building configuration...
Compressed configuration from 781 bytes to 535 bytes[OK]
```

Что было сделано: были созданы VLAN. 
Проверка:
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-00_37.png?raw=true)
Также переименовал коммутатор, чтобы было удобнее. 

---
# Шаг 2: Настройка коммутатора Switch1
```

Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname Switch1_ACS
Switch1_ACS(config)#vlan 4
Switch1_ACS(config-vlan)#name Inzenerni
Switch1_ACS(config-vlan)#ex
Switch1_ACS(config)#
Switch1_ACS(config)#
Switch1_ACS(config)#vlan 71
Switch1_ACS(config-vlan)#name Manager
Switch1_ACS(config-vlan)#ex
Switch1_ACS(config)#vlan 84
Switch1_ACS(config-vlan)#name Rukowod
Switch1_ACS(config-vlan)#ex
Switch1_ACS(config)#vlan 86
Switch1_ACS(config-vlan)#name Stazer
Switch1_ACS(config-vlan)#ex
Switch1_ACS(config)#
*Oct 13 21:44:50.772: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
Switch1_ACS(config)#
Switch1_ACS(config)#vlan 999
Switch1_ACS(config-vlan)#name Native_VLAN
Switch1_ACS(config-vlan)#
Switch1_ACS(config-vlan)#ex
Switch1_ACS(config)#
```
Также были созданы VLAN и для удобства переименован коммутатор 
Проверка:
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-00_47.png?raw=true)

---
# Шаг 3: Задаем IP-адреса VPC
## VPC 1
```VPC_1
ip 10.10.4.2 255.255.255.0 10.10.4.1
save
show ip
```
Проверка:
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-01_05.png?raw=true)
## VPC 2
```VPC_2
ip 10.10.71.2 255.255.255.0 10.10.71.1
save
show ip
```
Проверка: 
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-01_09.png?raw=true)

## VPC 3
```VPC_3
ip 10.10.84.2 255.255.255.240 10.10.84.1
save
show ip
```
Проверка:
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-01_12.png?raw=true)

## VPC 4
```VPC_4
ip 10.10.86.2 255.255.255.224 10.10.86.1
save
show ip
```
Проверка :
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-01_15.png?raw=true)

## VPC 5
```VPC_5
ip 10.10.86.3 255.255.255.224 10.10.86.1
save
show ip
```
Проверка:
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-01_17.png?raw=true)

# Шаг 4: Настройка access портов
Настройка VLAN 4:
```
Switch1_ACS>en
Switch1_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch1_ACS(config)#interface e0/1
Switch1_ACS(config-if)#switchport mode access
Switch1_ACS(config-if)#switchport access vlan 4
Switch1_ACS(config-if)#no shutdown
Switch1_ACS(config-if)#ex
```

Настройка VLAN 71:
```
Switch1_ACS(config)#interface e0/2
Switch1_ACS(config-if)#switchport mode access
Switch1_ACS(config-if)#switchport access vlan 71
Switch1_ACS(config-if)#no shutdown
Switch1_ACS(config-if)#ex
```

Настройка VLAN 84:
```
Switch1_ACS(config)#interface e0/3
Switch1_ACS(config-if)#switchport mode access
Switch1_ACS(config-if)#switchport access vlan 84
Switch1_ACS(config-if)#no shutdown
Switch1_ACS(config-if)#ex
```

Настройка VLAN 86
```
Switch1_ACS(config-if)#ex
Switch1_ACS(config)#interface e1/0
Switch1_ACS(config-if)#switchport mode access
Switch1_ACS(config-if)#switchport access vlan 86
Switch1_ACS(config-if)#no shutdown
Switch1_ACS(config-if)#ex
Switch1_ACS(config)#interface e1/1
Switch1_ACS(config-if)#switchport mode access
Switch1_ACS(config-if)#switchport access vlan 86
Switch1_ACS(config-if)#ex
```

Проверка:
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-01_30.png?raw=true)
 Отключение неиспользуемых портов на Switch1:
 ```
Switch1_ACS(config)#interface range Et1/2-3
Switch1_ACS(config-if-range)#shutdown
Switch1_ACS(config-if-range)#exit
 
Switch1_ACS(config)#interface range Et2/0-3
Switch1_ACS(config-if-range)#shutdown
Switch1_ACS(config-if-range)#exit
Switch1_ACS(config)#
 ```
 Проверка:
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-01_37.png?raw=true)
 Отключение неиспользуемых портов на Switch3:
 ```
Switch3_DSTR(config)#interface range Et0/1-3
Switch3_DSTR(config-if-range)#shutdown
Switch3_DSTR(config-if-range)#ex
Switch3_DSTR(config)#
 ```
 Проверка: 
 ![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-01_42.png?raw=true)

Отключение автосогласования DTP
```
Switch1_ACS(config)#interface range et0/1-3
Switch1_ACS(config-if-range)#switchport nonegotiate
Switch1_ACS(config-if-range)#no shutdown
Switch1_ACS(config-if-range)#ex
Switch1_ACS(config)#interface range et1/0-1
Switch1_ACS(config-if-range)#switchport nonegotiate
Switch1_ACS(config-if-range)#no shutdown
Switch1_ACS(config-if-range)#ex
```

## Шаг 5: Настройка LACP
PS:Только сейчас понял, что sw1 и sw2 нужно соединить 2 раза, так что исправляю топологию

Настройка sw3
Создание физических портов для LACP
```
Switch3_DSTR(config)#interface et0/0
Switch3_DSTR(config-if)# switchport trunk encapsulation dot1q
Switch3_DSTR(config-if)# switchport mode trunk
Switch3_DSTR(config-if)# switchport trunk native vlan 999
Switch3_DSTR(config-if)# switchport trunk allowed vlan 4,71,84,86
Switch3_DSTR(config-if)# switchport nonegotiate
Switch3_DSTR(config-if)# channel-group 1 mode active
Creating a port-channel interface Port-channel 1
Switch3_DSTR(config-if)# no shutdown
Switch3_DSTR(config-if)#exit

Switch3_DSTR(config)#interface et0/1
Switch3_DSTR(config-if)# switchport trunk encapsulation dot1q
Switch3_DSTR(config-if)# switchport mode trunk
Switch3_DSTR(config-if)# switchport trunk native vlan 999
Switch3_DSTR(config-if)# switchport trunk allowed vlan 4,71,84,86
Switch3_DSTR(config-if)# switchport nonegotiate
Switch3_DSTR(config-if)# channel-group 1 mode active
Switch3_DSTR(config-if)# no shutdown
Switch3_DSTR(config-if)#exit
```
range хотел использовать, но было уже поздно


Настройка Port-channel
```
Switch3_DSTR(config)#interface Port-channel1
Switch3_DSTR(config-if)# switchport trunk encapsulation dot1q
Switch3_DSTR(config-if)# switchport mode trunk
Switch3_DSTR(config-if)# switchport trunk native vlan 999
Switch3_DSTR(config-if)# switchport trunk allowed vlan 4,71,84,86
Switch3_DSTR(config-if)# no shutdown
Switch3_DSTR(config-if)#exit
```
Проверка
![Image|700x355](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/02_%D0%9B%D0%B0%D0%B1%D0%BE%D1%82%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%202.%20VLAN-14.10.2025-02_07.png?raw=true)

Настройка sw1
Настройка физических портов для LACP


