![[03_Лабораторная работа 3. STP-15.10.2025-21_28.png]]
Схема сети 
## Шаг 1. Создание VLAN на коммутаторах ядра
Коммутатор PiterSW1_core:
```
PiterSW1_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_Core(config)#vlan 71
PiterSW1_Core(config-vlan)#name Dir
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 77
PiterSW1_Core(config-vlan)#name Zam
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 112
PiterSW1_Core(config-vlan)#name secret
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 999
PiterSW1_Core(config-vlan)#name Native
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#ex
% Ambiguous command:  "ex"
PiterSW1_Core(config)#exit
PiterSW1_Core#
*Oct 16 17:06:35.209: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#write memory
Building configuration...
Compressed configuration from 808 bytes to 559 bytes[OK]
PiterSW1_Core#
```
Все те же самые команды прописываю на коммутаторе PiterSW2_Core.
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW2_Core
PiterSW2_Core(config)#vlan 71
PiterSW2_Core(config-vlan)#QQ
PiterSW2_Core(config-vlan)#name Dir
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 77
PiterSW2_Core(config-vlan)#name Zam
PiterSW2_Core(config-vlan)#
*Oct 16 17:14:02.602: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
PiterSW2_Core(config-vlan)#Q
PiterSW2_Core#Q
*Oct 16 17:16:53.662: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_Core#ex

































PiterSW2_Core con0 is now available





Press RETURN to get started.






PiterSW2_Core>
PiterSW2_Core>en
PiterSW2_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW2_Core(config)#vlan 112
PiterSW2_Core(config-vlan)#name secret
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#exit
PiterSW2_Core#wr
*Oct 16 17:19:41.272: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_Core#QQ
PiterSW2_Core#QQP0 P5Q
               ^
% Invalid input detected at '^' marker.

PiterSW2_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW2_Core(config)#vlan 999
PiterSW2_Core(config-vlan)#name Native
PiterSW2_Core(config-vlan)#

```