![[03_Лабораторная работа 3. STP-16.10.2025-21_51.png]]
Схема сети 
## Шаг 1. Создание VLAN на коммутаторах в Питере
Коммутатор PiterSW1_core:
```
PiterSW1_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_Core(config)#vlan 71
PiterSW1_Core(config-vlan)#name Dir
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 77
PiterSW1_Core(config-vlan)#name Zam
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 112
PiterSW1_Core(config-vlan)#name Secret
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 999
PiterSW1_Core(config-vlan)#name Native
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#ex
% Ambiguous command:  "ex"
PiterSW1_Core(config)#exit
PiterSW1_Core#
*Oct 16 17:06:35.209: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#write memory
Building configuration...
Compressed configuration from 808 bytes to 559 bytes[OK]
PiterSW1_Core#
```
![[03_Лабораторная работа 3. STP-16.10.2025-21_57.png]]
Все те же самые команды прописываю на коммутаторе PiterSW2_Core.
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW2_Core
PiterSW2_Core(config)#vlan 71
PiterSW2_Core(config-vlan)#name Dir
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 77
PiterSW2_Core(config-vlan)#name Zam
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 112
PiterSW2_Core(config-vlan)#name Secret
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 999
PiterSW2_Core(config-vlan)#name Native
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#exit
PiterSW2_Core#
*Oct 16 18:58:56.428: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_Core#wr mem

```
![[03_Лабораторная работа 3. STP-16.10.2025-22_02.png]]
Коммутатор PiterSW1_ACS
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW1_ACS
PiterSW1_ACS(config)#vlan 71
PiterSW1_ACS(config-vlan)#name Dir
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 77
PiterSW1_ACS(config-vlan)#name Zam
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 112
PiterSW1_ACS(config-vlan)#name secret
*Oct 16 17:34:39.164: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
PiterSW1_ACS(config-vlan)#name Secret
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 999
PiterSW1_ACS(config-vlan)#name Native
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#exit
PiterSW1_ACS#
*Oct 16 17:35:20.906: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#write memory
```
![[03_Лабораторная работа 3. STP-16.10.2025-22_05.png]]
Коммутатор PiterSW2_ACS
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW2_ACS
PiterSW2_ACS(config)#vlan 71
PiterSW2_ACS(config-vlan)#name Dir
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 77
PiterSW2_ACS(config-vlan)#name Zam
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 112
PiterSW2_ACS(config-vlan)#name secret
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 999
PiterSW2_ACS(config-vlan)#name Native
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#exit
PiterSW2_ACS#
*Oct 16 17:40:05.211: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#write memory

```
![[03_Лабораторная работа 3. STP-16.10.2025-22_09.png]]

# Шаг 2. Настройка ПК
VPC71_1
![[03_Лабораторная работа 3. STP-16.10.2025-22_12.png]]
VPC71_2
![[03_Лабораторная работа 3. STP-16.10.2025-22_13.png]]
VPC77_1
![[03_Лабораторная работа 3. STP-16.10.2025-22_15.png]]
VPC77_2
![[03_Лабораторная работа 3. STP-16.10.2025-22_16.png]]

# Шаг 3. Присвоение VLAN на каждом порту коммутаторов доступа
Настройка PiterSW1_ACS
```
PiterSW1_ACS>en
PiterSW1_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_ACS(config)#interface e0/2
PiterSW1_ACS(config-if)#switchport mode access
PiterSW1_ACS(config-if)#switchport access vlan 71
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#no shutdown
PiterSW1_ACS(config-if)#exit
PiterSW1_ACS(config)#interface e0/3
PiterSW1_ACS(config-if)#switchport mode access
PiterSW1_ACS(config-if)#switchport access vlan 112
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#no shutdown
PiterSW1_ACS(config-if)#exit
```
![[03_Лабораторная работа 3. STP-16.10.2025-22_30.png]]

Настройка PiterSW2_ACS
```
PiterSW2_ACS>en
PiterSW2_ACS#conf t
PiterSW2_ACS(config)#interface e0/2
PiterSW2_ACS(config-if)#switchport mode access
PiterSW2_ACS(config-if)#switchport access vlan 77
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#no shutdown
PiterSW2_ACS(config-if)#exit
PiterSW2_ACS(config)#interface e0/3
PiterSW2_ACS(config-if)#switchport mode access
PiterSW2_ACS(config-if)#switchport access vlan 112
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#no shutdown
PiterSW2_ACS(config-if)#exit
```
![[03_Лабораторная работа 3. STP-16.10.2025-22_33.png]]
Настройка Trunk на коммутаторах 

Что нужно сделать завтра
вообще схема транка 
речь про питерские 
sw1_acs - sw2_acs vlan 112

![[03_Лабораторная работа 3. STP-16.10.2025-23_06.png]]





PiterSW2_ACS

```
iterSW2_ACS(config)#interface e0/1
PiterSW2_ACS(config-if)#switchport trunk encapsulation dot1q
PiterSW2_ACS(config-if)#switchport mode trunk
PiterSW2_ACS(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW2_ACS(config-if)#switchport trunk native vlan 999
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#exit
```
PiterSW1_ACS
```
PiterSW1_ACS(config)#interface range e0/1
PiterSW1_ACS(config-if)#switchport trunk encapsulation dot1q
PiterSW1_ACS(config-if)#switchport mode trunk
PiterSW1_ACS(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW1_ACS(config-if)#switchport trunk native vlan 999
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#exit
```
PiterSW1_Core
```
PiterSW1_Core(config)#interface e0/3
PiterSW1_Core(config-if)#switchport trunk encapsulation dot1q
PiterSW1_Core(config-if)#switchport mode trunk
PiterSW1_Core(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW1_Core(config-if)#switchport trunk native vlan 999
PiterSW1_Core(config-if)#switchport nonegotiate
```
PiterSW2_Core
```
PiterSW2_Core(config)#interface e0/3
PiterSW2_Core(config-if)#switchport trunk encapsulation dot1q
PiterSW2_Core(config-if)#switchport mode trunk
PiterSW2_Core(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW2_Core(config-if)#switchport trunk native vlan 999
PiterSW2_Core(config-if)#switchport nonegotiate

```

# Настройка VLAN в Казани
KznSW1_Core

```
Switch(config)#hostname KznSW1_Core
KznSW1_Core(config)#
*Oct 17 06:25:11.617: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
KznSW1_Core(config)#vlan 4
KznSW1_Core(config-vlan)#name Inzenerni
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 71
KznSW1_Core(config-vlan)#name Manager
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 84
KznSW1_Core(config-vlan)#name Rukowod
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 86
KznSW1_Core(config-vlan)#name Stazer
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 999
KznSW1_Core(config-vlan)#name Native
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#exit
KznSW1_Core(config)#interface e0/0
KznSW1_Core(config-if)#switchport trunk encapsulation dot1q
KznSW1_Core(config-if)#switchport mode trunk
KznSW1_Core(config-if)#switchport trunk allowed vlan 4,71,84,86
KznSW1_Core(config-if)#switchport trunk native vlan 999
KznSW1_Core(config-if)#switchport nonegotiate
KznSW1_Core(config-if)#exit
```

KznSW2_Core
```
Switch(config)#vlan 4
Switch(config-vlan)#name Inzenerni
Switch(config-vlan)#ex
Switch(config)#vlan 71
Switch(config-vlan)#name Manager
Switch(config-vlan)#ex
Switch(config)#vlan 84
Switch(config-vlan)#name
*Oct 17 06:32:04.593: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
Switch(config-vlan)#name Rukowod
Switch(config-vlan)#ex
Switch(config)#vlan 86
Switch(config-vlan)#name Stazer
Switch(config-vlan)#ex
Switch(config)#vlan 999
Switch(config-vlan)#name Native
Switch(config-vlan)#exit
Switch(config)#interface e0/0
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk allowed vlan 4,71,84,86
Switch(config-if)#switchport trunk native vlan 999
Switch(config-if)#switchport nonegotiate
Switch(config-if)#exit
Switch(config)#
```

Switch3 DSTR:
```
Switch3_DSTR(config)#interface e0/3
Switch3_DSTR(config-if)#switchport trunk encapsulation dot1q
Switch3_DSTR(config-if)#switchport mode trunk
Switch3_DSTR(config-if)#switchport trunk allowed vlan 4,71,84,86
Switch3_DSTR(config-if)#switchport trunk native vlan 999
Switch3_DSTR(config-if)#switchport nonegotiate
Switch3_DSTR(config-if)#interface e0/2
Switch3_DSTR(config-if)#switchport trunk encapsulation dot1q
Switch3_DSTR(config-if)#switchport mode trunk
Switch3_DSTR(config-if)#switchport trunk allowed vlan 4,71,84,86
Switch3_DSTR(config-if)#switchport trunk native vlan 999
Switch3_DSTR(config-if)#switchport nonegotiate
Switch3_DSTR(config-if)#exit
```

# Отключение протокола DTP
Во время работы я уже отключил этот протокол на портах


| имя устройства |  выкл  |    вкл     |
| -------------- | :----: | :--------: |
| PiterSW1_ACS   | e0/1-3 | e0/0, e1/0 |
| PiterSW2_ACS   | e0/1-3 | e0/0, e1/0 |
| PiterSW1_Core  |  e0/3  |   e0/0-2   |
| PiterSW2_Core  |  e0/3  |   e0/0-2   |


PiterSW1_ACS
```
PiterSW1_ACS(config)#interface e0/0
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#ex
PiterSW1_ACS(config)#interface e1/0
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#ex
```

```
PiterSW2_ACS(config)#interface e0/0
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#ex
PiterSW2_ACS(config)#interface e1/0
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#ex
PiterSW2_ACS(config)#
```

```
PiterSW1_Core(config)#interface range e0/0-2
PiterSW1_Core(config-if-range)#switchport nonegotiate
PiterSW1_Core(config-if-range)#ex

```

```
PiterSW2_Core(config)#interface range e0/0-2
PiterSW2_Core(config-if-range)#switchport nonegotiate
PiterSW2_Core(config-if-range)#ex
```


Отключение портов
```
PiterSW1_ACS(config)#interface range e1/1-3
PiterSW1_ACS(config-if-range)#shutdown
PiterSW1_ACS(config-if-range)#ex
PiterSW1_ACS(config)#
```
![[03_Лабораторная работа 3. STP-17.10.2025-10_22-1.png]]

```
PiterSW2_ACS(config)#interface range e1/1-3
PiterSW2_ACS(config-if-range)#shutdown
PiterSW2_ACS(config-if-range)#ex
PiterSW2_ACS(config)#
```
![[03_Лабораторная работа 3. STP-17.10.2025-10_22-2.png]]

```
KznSW1_Core(config)#interface e0/3
KznSW1_Core(config-if)#shutdown
KznSW1_Core(config-if)#ex
```
![[03_Лабораторная работа 3. STP-17.10.2025-10_21.png]]

```
Switch(config)#interface e0/3
Switch(config-if)#shutdown
Switch(config-if)#ex
```
![[03_Лабораторная работа 3. STP-17.10.2025-10_20.png]]


```

KznSW1_Core(config)#interface Port-channel1
KznSW1_Core(config-if)#switchport trunk encapsulation dot1q
KznSW1_Core(config-if)#switchport mode trunk
KznSW1_Core(config-if)#switchport trunk allowed vlan 4,71,84,86
KznSW1_Core(config-if)#switchport trunk native vlan 999
KznSW1_Core(config-if)#switchport nonegotiate
KznSW1_Core(config-if)#exit

```