![[03_Лабораторная работа 3. STP-16.10.2025-21_51.png]]
Схема сети 
## Шаг 1. Создание VLAN на коммутаторах в Питере
Коммутатор PiterSW1_core:
```
PiterSW1_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_Core(config)#vlan 71
PiterSW1_Core(config-vlan)#name Dir
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 77
PiterSW1_Core(config-vlan)#name Zam
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 112
PiterSW1_Core(config-vlan)#name Secret
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 999
PiterSW1_Core(config-vlan)#name Native
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#ex
% Ambiguous command:  "ex"
PiterSW1_Core(config)#exit
PiterSW1_Core#
*Oct 16 17:06:35.209: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#write memory
Building configuration...
Compressed configuration from 808 bytes to 559 bytes[OK]
PiterSW1_Core#
```
![[03_Лабораторная работа 3. STP-16.10.2025-21_57.png]]
Все те же самые команды прописываю на коммутаторе PiterSW2_Core.
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW2_Core
PiterSW2_Core(config)#vlan 71
PiterSW2_Core(config-vlan)#name Dir
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 77
PiterSW2_Core(config-vlan)#name Zam
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 112
PiterSW2_Core(config-vlan)#name Secret
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 999
PiterSW2_Core(config-vlan)#name Native
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#exit
PiterSW2_Core#
*Oct 16 18:58:56.428: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_Core#wr mem

```
![[03_Лабораторная работа 3. STP-16.10.2025-22_02.png]]
Коммутатор PiterSW1_ACS
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW1_ACS
PiterSW1_ACS(config)#vlan 71
PiterSW1_ACS(config-vlan)#name Dir
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 77
PiterSW1_ACS(config-vlan)#name Zam
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 112
PiterSW1_ACS(config-vlan)#name secret
*Oct 16 17:34:39.164: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
PiterSW1_ACS(config-vlan)#name Secret
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 999
PiterSW1_ACS(config-vlan)#name Native
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#exit
PiterSW1_ACS#
*Oct 16 17:35:20.906: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#write memory
```
![[03_Лабораторная работа 3. STP-16.10.2025-22_05.png]]
Коммутатор PiterSW2_ACS
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW2_ACS
PiterSW2_ACS(config)#vlan 71
PiterSW2_ACS(config-vlan)#name Dir
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 77
PiterSW2_ACS(config-vlan)#name Zam
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 112
PiterSW2_ACS(config-vlan)#name secret
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 999
PiterSW2_ACS(config-vlan)#name Native
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#exit
PiterSW2_ACS#
*Oct 16 17:40:05.211: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#write memory

```
![[03_Лабораторная работа 3. STP-16.10.2025-22_09.png]]

# Шаг 2. Настройка ПК
VPC71_1
![[03_Лабораторная работа 3. STP-16.10.2025-22_12.png]]
VPC71_2
![[03_Лабораторная работа 3. STP-16.10.2025-22_13.png]]
VPC77_1
![[03_Лабораторная работа 3. STP-16.10.2025-22_15.png]]
VPC77_2
![[03_Лабораторная работа 3. STP-16.10.2025-22_16.png]]

# Шаг 3. Присвоение VLAN на каждом порту коммутаторов доступа
Настройка PiterSW1_ACS
```
PiterSW1_ACS>en
PiterSW1_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_ACS(config)#interface e0/2
PiterSW1_ACS(config-if)#switchport mode access
PiterSW1_ACS(config-if)#switchport access vlan 71
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#no shutdown
PiterSW1_ACS(config-if)#exit
PiterSW1_ACS(config)#interface e0/3
PiterSW1_ACS(config-if)#switchport mode access
PiterSW1_ACS(config-if)#switchport access vlan 112
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#no shutdown
PiterSW1_ACS(config-if)#exit
```
![[03_Лабораторная работа 3. STP-16.10.2025-22_30.png]]

Настройка PiterSW2_ACS
```
PiterSW2_ACS>en
PiterSW2_ACS#conf t
PiterSW2_ACS(config)#interface e0/2
PiterSW2_ACS(config-if)#switchport mode access
PiterSW2_ACS(config-if)#switchport access vlan 77
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#no shutdown
PiterSW2_ACS(config-if)#exit
PiterSW2_ACS(config)#interface e0/3
PiterSW2_ACS(config-if)#switchport mode access
PiterSW2_ACS(config-if)#switchport access vlan 112
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#no shutdown
PiterSW2_ACS(config-if)#exit
```
![[03_Лабораторная работа 3. STP-16.10.2025-22_33.png]]
Настройка Trunk на коммутаторах 

Что нужно сделать завтра
вообще схема транка 
речь про питерские 
sw1_acs - sw2_acs vlan 112

![[03_Лабораторная работа 3. STP-16.10.2025-23_06.png]]





PiterSW2_ACS

```
iterSW2_ACS(config)#interface e0/1
PiterSW2_ACS(config-if)#switchport trunk encapsulation dot1q
PiterSW2_ACS(config-if)#switchport mode trunk
PiterSW2_ACS(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW2_ACS(config-if)#switchport trunk native vlan 999
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#exit
```
PiterSW1_ACS
```
PiterSW1_ACS(config)#interface range e0/1
PiterSW1_ACS(config-if)#switchport trunk encapsulation dot1q
PiterSW1_ACS(config-if)#switchport mode trunk
PiterSW1_ACS(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW1_ACS(config-if)#switchport trunk native vlan 999
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#exit
```
PiterSW1_Core
```
PiterSW1_Core(config)#interface e0/3
PiterSW1_Core(config-if)#switchport trunk encapsulation dot1q
PiterSW1_Core(config-if)#switchport mode trunk
PiterSW1_Core(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW1_Core(config-if)#switchport trunk native vlan 999
PiterSW1_Core(config-if)#switchport nonegotiate
```
PiterSW2_Core
```
PiterSW2_Core(config)#interface e0/3
PiterSW2_Core(config-if)#switchport trunk encapsulation dot1q
PiterSW2_Core(config-if)#switchport mode trunk
PiterSW2_Core(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW2_Core(config-if)#switchport trunk native vlan 999
PiterSW2_Core(config-if)#switchport nonegotiate

```

# Настройка VLAN в Казани
KznSW1_Core

```
Switch(config)#hostname KznSW1_Core
KznSW1_Core(config)#
*Oct 17 06:25:11.617: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
KznSW1_Core(config)#vlan 4
KznSW1_Core(config-vlan)#name Inzenerni
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 71
KznSW1_Core(config-vlan)#name Manager
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 84
KznSW1_Core(config-vlan)#name Rukowod
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 86
KznSW1_Core(config-vlan)#name Stazer
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#vlan 999
KznSW1_Core(config-vlan)#name Native
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#exit
KznSW1_Core(config)#interface e0/0
KznSW1_Core(config-if)#switchport trunk encapsulation dot1q
KznSW1_Core(config-if)#switchport mode trunk
KznSW1_Core(config-if)#switchport trunk allowed vlan 4,71,84,86
KznSW1_Core(config-if)#switchport trunk native vlan 999
KznSW1_Core(config-if)#switchport nonegotiate
KznSW1_Core(config-if)#exit
```

KznSW2_Core
```
Switch(config)#vlan 4
Switch(config-vlan)#name Inzenerni
Switch(config-vlan)#ex
Switch(config)#vlan 71
Switch(config-vlan)#name Manager
Switch(config-vlan)#ex
Switch(config)#vlan 84
Switch(config-vlan)#name
*Oct 17 06:32:04.593: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
Switch(config-vlan)#name Rukowod
Switch(config-vlan)#ex
Switch(config)#vlan 86
Switch(config-vlan)#name Stazer
Switch(config-vlan)#ex
Switch(config)#vlan 999
Switch(config-vlan)#name Native
Switch(config-vlan)#exit
Switch(config)#interface e0/0
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk allowed vlan 4,71,84,86
Switch(config-if)#switchport trunk native vlan 999
Switch(config-if)#switchport nonegotiate
Switch(config-if)#exit
Switch(config)#
```

Switch3 DSTR:
```
Switch3_DSTR(config)#interface e0/3
Switch3_DSTR(config-if)#switchport trunk encapsulation dot1q
Switch3_DSTR(config-if)#switchport mode trunk
Switch3_DSTR(config-if)#switchport trunk allowed vlan 4,71,84,86
Switch3_DSTR(config-if)#switchport trunk native vlan 999
Switch3_DSTR(config-if)#switchport nonegotiate
Switch3_DSTR(config-if)#interface e0/2
Switch3_DSTR(config-if)#switchport trunk encapsulation dot1q
Switch3_DSTR(config-if)#switchport mode trunk
Switch3_DSTR(config-if)#switchport trunk allowed vlan 4,71,84,86
Switch3_DSTR(config-if)#switchport trunk native vlan 999
Switch3_DSTR(config-if)#switchport nonegotiate
Switch3_DSTR(config-if)#exit
```

# Отключение протокола DTP
Во время работы я уже отключил этот протокол на портах


| имя устройства |  выкл  |    вкл     |
| -------------- | :----: | :--------: |
| PiterSW1_ACS   | e0/1-3 | e0/0, e1/0 |
| PiterSW2_ACS   | e0/1-3 | e0/0, e1/0 |
| PiterSW1_Core  |  e0/3  |   e0/0-2   |
| PiterSW2_Core  |  e0/3  |   e0/0-2   |


PiterSW1_ACS
```
PiterSW1_ACS(config)#interface e0/0
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#ex
PiterSW1_ACS(config)#interface e1/0
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#ex
```

```
PiterSW2_ACS(config)#interface e0/0
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#ex
PiterSW2_ACS(config)#interface e1/0
PiterSW2_ACS(config-if)#switchport nonegotiate
PiterSW2_ACS(config-if)#ex
PiterSW2_ACS(config)#
```

```
PiterSW1_Core(config)#interface range e0/0-2
PiterSW1_Core(config-if-range)#switchport nonegotiate
PiterSW1_Core(config-if-range)#ex

```

```
PiterSW2_Core(config)#interface range e0/0-2
PiterSW2_Core(config-if-range)#switchport nonegotiate
PiterSW2_Core(config-if-range)#ex
```


Отключение портов
PiterSW1_ACS
```
PiterSW1_ACS(config)#interface range e1/1-3
PiterSW1_ACS(config-if-range)#shutdown
PiterSW1_ACS(config-if-range)#ex
PiterSW1_ACS(config)#
```
![[03_Лабораторная работа 3. STP-17.10.2025-10_22-1.png]]

PiterSW2_ACS
```
PiterSW2_ACS(config)#interface range e1/1-3
PiterSW2_ACS(config-if-range)#shutdown
PiterSW2_ACS(config-if-range)#ex
PiterSW2_ACS(config)#
```
![[03_Лабораторная работа 3. STP-17.10.2025-10_22-2.png]]

KznSW1_Core
```
KznSW1_Core(config)#interface e0/3
KznSW1_Core(config-if)#shutdown
KznSW1_Core(config-if)#ex
```
![[03_Лабораторная работа 3. STP-17.10.2025-10_21.png]]

KznSW2_Core
```
Switch(config)#interface e0/3
Switch(config-if)#shutdown
Switch(config-if)#ex
```
![[03_Лабораторная работа 3. STP-17.10.2025-10_20.png]]


# Настройка LACP KZN
KznSW1_Core
```
KznSW1_Core(config)#interface range e0/1 - 2
KznSW1_Core(config-if-range)#switchport trunk encapsulation dot1q
KznSW1_Core(config-if-range)#switchport mode trunk
KznSW1_Core(config-if-range)#switchport trunk allowed vlan 4,71,84,86
KznSW1_Core(config-if-range)#switchport trunk native vlan 999
KznSW1_Core(config-if-range)#channel-group 1 mode active
KznSW1_Core(config-if-range)#switchport nonegotiate
KznSW1_Core(config-if-range)#exit
KznSW1_Core(config)#
KznSW1_Core(config)#interface Port-channel1
KznSW1_Core(config-if)#switchport trunk encapsulation dot1q
KznSW1_Core(config-if)#switchport mode trunk
KznSW1_Core(config-if)#switchport trunk allowed vlan 4,71,84,86
KznSW1_Core(config-if)#switchport trunk native vlan 999
KznSW1_Core(config-if)#switchport nonegotiate
KznSW1_Core(config-if)#exit
KznSW1_Core(config)#


```
![[03_Лабораторная работа 3. STP-17.10.2025-11_34.png]]
KznSW2_Core
```
Switch(config)#interface range e0/1 - 2
Switch(config-if-range)#switchport trunk encapsulation dot1q
Switch(config-if-range)#switchport mode trunk
Switch(config-if-range)#switchport trunk allowed vlan 4,71,84,86
Switch(config-if-range)#switchport trunk native vlan 999
Switch(config-if-range)#channel-group 1 mode active
Switch(config-if-range)#switchport nonegotiate
Switch(config-if-range)#exit
Switch(config)#
*Oct 17 08:27:10.935: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/2, changed state to up
Switch(config)#
*Oct 17 08:27:18.374: %EC-5-L3DONTBNDL2: Et0/2 suspended: LACP currently not enabled on the remote port.
*Oct 17 08:27:19.379: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/2, changed state to down
Switch(config)#interface Port-channel1
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk allowed vlan 4,71,84,86
Switch(config-if)#switchport trunk native vlan 999
Switch(config-if)#switchport nonegotiate
Switch(config-if)#exit
Switch(config)#


```
![[03_Лабораторная работа 3. STP-17.10.2025-11_34-1.png]]

# Настройка LACP PITER
```
PiterSW1_Core(config)#interface range e0/0-1
PiterSW1_Core(config-if-range)#switchport trunk encapsulation dot1q
PiterSW1_Core(config-if-range)#switchport mode trunk
PiterSW1_Core(config-if-range)#switchport trunk allowed vlan 71,77,112
PiterSW1_Core(config-if-range)#switchport trunk native vlan 999
PiterSW1_Core(config-if-range)#channel-group 1 mode active
Creating a port-channel interface Port-channel 1

PiterSW1_Core(config-if-range)#switchport nonegotiate
PiterSW1_Core(config-if-range)#exit
PiterSW1_Core(config)#
PiterSW1_Core(config)#interface Port-channel1
PiterSW1_Core(config-if)#switchport trunk encapsulation dot1q
PiterSW1_Core(config-if)#switchport mode trunk
PiterSW1_Core(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW1_Core(config-if)#switchport trunk native vlan 999
PiterSW1_Core(config-if)#switchport nonegotiate
PiterSW1_Core(config-if)#exit
```
![[03_Лабораторная работа 3. STP-17.10.2025-11_57.png]]

```
PiterSW2_Core(config)#interface range e0/0-1
PiterSW2_Core(config-if-range)#switchport trunk encapsulation dot1q
PiterSW2_Core(config-if-range)#switchport mode trunk
PiterSW2_Core(config-if-range)#switchport trunk allowed vlan 71,77,112
PiterSW2_Core(config-if-range)#switchport trunk native vlan 999
PiterSW2_Core(config-if-range)#channel-group 1 mode active
Creating a port-channel interface Port-channel 1

PiterSW2_Core(config-if-range)#switchport nonegotiate
PiterSW2_Core(config-if-range)#exit
PiterSW2_Core(config)#
PiterSW2_Core(config)#interface Port-channel1
PiterSW2_Core(config-if)#switchport trunk encapsulation dot1q
PiterSW2_Core(config-if)#switchport mode trunk
PiterSW2_Core(config-if)#switchport trunk allowed vlan 71,77,112
PiterSW2_Core(config-if)#switchport trunk native vlan 999
PiterSW2_Core(config-if)#switchport nonegotiate
PiterSW2_Core(config-if)#exit

```
![[03_Лабораторная работа 3. STP-17.10.2025-11_56.png]]

# Настройка STP
Питер PVST
1. Включаю на всех коммутаторах pvst с помощью команды `spanning-tree mode pvst`. 
2. Настраиваю Root primary для vlan  `PiterSW1_Core(config)#spanning-tree vlan 71 root primary`; `PiterSW2_Core(config)#spanning-tree vlan 77,112 root primary`
3. Настройка PortFast. 
```
PiterSW1_ACS(config)#int range e0/2-3
PiterSW1_ACS(config-if-range)#spanning-tree portfast
```

```
PiterSW2_ACS(config)#int range e0/2-3
PiterSW2_ACS(config-if-range)#spanning-tree portfast
```
4. Настройка BPDU Guard
```
PiterSW1_ACS(config)#int range e0/2-3
PiterSW1_ACS(config-if-range)#spanning-tree bpduguard enable
PiterSW1_ACS(config-if-range)#ex
```

```
PiterSW2_ACS(config)#int range e0/2-3
PiterSW2_ACS(config-if-range)#spanning-tree bpduguard enable
PiterSW2_ACS(config-if-range)#ex
```

5. Настройка Root guard

```
PiterSW1_Core(config)#int range e0/2-3
PiterSW1_Core(config-if-range)#spanning-tree guard root
PiterSW1_Core(config-if-range)#ex
*Oct 17 09:41:48.614: %SPANTREE-2-ROOTGUARD_CONFIG_CHANGE: Root guard enabled on port Ethernet0/2.
*Oct 17 09:41:48.614: %SPANTREE-2-ROOTGUARD_CONFIG_CHANGE: Root guard enabled on port Ethernet0/3.
PiterSW1_Core(config-if-range)#ex
```

```
PiterSW2_Core(config)#int range e0/2-3
PiterSW2_Core(config-if-range)#spanning-tree guard root
PiterSW2_Core(config-if-range)#
*Oct 17 09:42:57.028: %SPANTREE-2-ROOTGUARD_CONFIG_CHANGE: Root guard enabled on port Ethernet0/2.
*Oct 17 09:42:57.028: %SPANTREE-2-ROOTGUARD_CONFIG_CHANGE: Root guard enabled on port Ethernet0/3.
*Oct 17 09:42:57.028: %SPANTREE-2-ROOTGUARD_BLOCK: Root guard blocking port Ethernet0/2 on VLAN0001.
PiterSW2_Core(config-if-range)#ex

```

Настройка MSTP в Казани
1. Прописываю `spanning-tree mode mst` на всех коммутаторах 

```

KznSW1_Core(config)#spanning-tree mst configuration
KznSW1_Core(config-mst)#name Kzn
KznSW1_Core(config-mst)#revision 1
KznSW1_Core(config-mst)#instance 1 vlan 4,71,984
KznSW1_Core(config-mst)#instance 2 vlan 84,86
KznSW1_Core(config-mst)#ex

```

```
Switch(config)#spanning-tree mst configuration
Switch(config-mst)#name Kzn
Switch(config-mst)#revision 1
Switch(config-mst)#instance 1 vlan 4,71,984
Switch(config-mst)#instance 2 vlan 84,86
Switch(config-mst)#ex
Switch(config)#

```

```
Switch3_DSTR(config)#spanning-tree mst configuration
Switch3_DSTR(config-mst)#name Kzn
Switch3_DSTR(config-mst)#revision 1
Switch3_DSTR(config-mst)#instance 1 vlan 4,71,984
Switch3_DSTR(config-mst)#instance 2 vlan 84,86
Switch3_DSTR(config-mst)#ex
Switch3_DSTR(config)#

```

```
Switch1_ACS(config)#spanning-tree mst configuration
Switch1_ACS(config-mst)#name Kzn
Switch1_ACS(config-mst)#revision 1
Switch1_ACS(config-mst)#instance 1 vlan 4,71,984
Switch1_ACS(config-mst)#instance 2 vlan 84,86
Switch1_ACS(config-mst)#ex
Switch1_ACS(config)#

```

Указываю корневой коммутатор
```
KznSW1_Core(config)#spanning-tree mst 1 root primary
```
```
Switch(config)#spanning-tree mst 2 root primary
```

Настройка PortFast и BPDU
```
Switch1_ACS(config)#int range e0/1-3
Switch1_ACS(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 3 interfaces due to the range command
 but will only have effect when the interfaces are in a non-trunking mode.
Switch1_ACS(config-if-range)#spanning-tree bpduguard enable
```
```
Switch1_ACS(config)#int range e1/0-1
Switch1_ACS(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 2 interfaces due to the range command
 but will only have effect when the interfaces are in a non-trunking mode.
Switch1_ACS(config-if-range)#spanning-tree bpduguard enable
```

Перенос терминации VLAN 84 И 86 на KznSW2_Core
```
Switch(config)#int vlan 84
Switch(config-if)#
*Oct 17 10:27:02.282: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan84, changed state to down
Switch(config-if)#ip address 10.10.84.1 255.255.255.240
Switch(config-if)#no shutdown
Switch(config-if)#ex
Switch(config)#
*Oct 17 10:27:38.200: %LINK-3-UPDOWN: Interface Vlan84, changed state to up
*Oct 17 10:27:39.208: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan84, changed state to up
Switch(config)#interface vlan 86
Switch(config-if)#
*Oct 17 10:27:55.200: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan86, changed state to down
Switch(config-if)#ip address 10.10.86.1 255.255.255.224
Switch(config-if)#no shutdown
Switch(config-if)#
*Oct 17 10:28:10.736: %LINK-3-UPDOWN: Interface Vlan86, changed state to up
*Oct 17 10:28:11.740: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan86, changed state to up
Switch(config-if)#exit

```
Терминация VLAN 4,71,984 на коммутаторе KznSW1_Core
```
KznSW1_Core>en
KznSW1_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
KznSW1_Core(config)#int vlan 4
KznSW1_Core(config-if)#
*Oct 17 10:32:36.148: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan4, changed state to down
KznSW1_Core(config-if)#ip address 10.10.4.1 255.255.255.0
KznSW1_Core(config-if)#no shutdown
KznSW1_Core(config-if)#exit
KznSW1_Core(config)#
*Oct 17 10:33:01.615: %LINK-3-UPDOWN: Interface Vlan4, changed state to up
*Oct 17 10:33:02.616: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan4, changed state to up
KznSW1_Core(config)#vlan 71
KznSW1_Core(config-vlan)#ex
KznSW1_Core(config)#int vlan 71
KznSW1_Core(config-if)#
*Oct 17 10:33:32.244: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan71, changed state to down
KznSW1_Core(config-if)#ip address 10.10.71.1 255.255.255.0
KznSW1_Core(config-if)#
KznSW1_Core(config-if)#no shutdown
KznSW1_Core(config-if)#ex
KznSW1_Core(config)#
*Oct 17 10:34:04.268: %LINK-3-UPDOWN: Interface Vlan71, changed state to up
*Oct 17 10:34:05.270: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan71, changed state to up

```

Терминация VLAN 71 на коммутаторе PiterSW1_Core
```
PiterSW1_Core>en
PiterSW1_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_Core(config)#int vlan 77
PiterSW1_Core(config-if)#
*Oct 17 10:42:05.672: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan77, changed state to down
PiterSW1_Core(config-if)#ip address 172.18.71.1 255.255.255.240
PiterSW1_Core(config-if)#no shutdown
PiterSW1_Core(config-if)#
*Oct 17 10:42:28.640: %LINK-3-UPDOWN: Interface Vlan77, changed state to up
*Oct 17 10:42:29.640: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan77, changed state to up
PiterSW1_Core(config-if)#exit
PiterSW1_Core(config)#

```
![[03_Лабораторная работа 3. STP-17.10.2025-13_45-1.png]]
Терминация VLAN 77, 112 на коммутаторе PiterSW2_Core
```
PiterSW2_Core>en
PiterSW2_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW2_Core(config)#int vlan 77
PiterSW2_Core(config-if)#
*Oct 17 10:43:44.172: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan77, changed state to down
PiterSW2_Core(config-if)#ip address 172.18.77.1 255.255.255.240
PiterSW2_Core(config-if)#no shutdown
PiterSW2_Core(config-if)#ex
*Oct 17 10:44:04.230: %LINK-3-UPDOWN: Interface Vlan77, changed state to up
*Oct 17 10:44:05.233: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan77, changed state to up
PiterSW2_Core(config-if)#exit
PiterSW2_Core(config)#int vlan 112
PiterSW2_Core(config-if)#
*Oct 17 10:44:13.955: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan112, changed state to down
PiterSW2_Core(config-if)#ip address 172.18.112.1 255.255.255.240
PiterSW2_Core(config-if)#no shutdown
PiterSW2_Core(config-if)#exit
PiterSW2_Core(config)#
*Oct 17 10:44:34.537: %LINK-3-UPDOWN: Interface Vlan112, changed state to up
*Oct 17 10:44:35.545: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan112, changed state to up
```
![[03_Лабораторная работа 3. STP-17.10.2025-13_45.png]]