![[03_Лабораторная работа 3. STP-15.10.2025-21_28.png]]
Схема сети 
## Шаг 1. Создание VLAN на коммутаторах в Питере
Коммутатор PiterSW1_core:
```
PiterSW1_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_Core(config)#vlan 71
PiterSW1_Core(config-vlan)#name Dir
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 77
PiterSW1_Core(config-vlan)#name Zam
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 112
PiterSW1_Core(config-vlan)#name secret
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 999
PiterSW1_Core(config-vlan)#name Native
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#ex
% Ambiguous command:  "ex"
PiterSW1_Core(config)#exit
PiterSW1_Core#
*Oct 16 17:06:35.209: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#write memory
Building configuration...
Compressed configuration from 808 bytes to 559 bytes[OK]
PiterSW1_Core#
```
![[03_Лабораторная работа 3. STP-16.10.2025-20_27.png]]
Все те же самые команды прописываю на коммутаторе PiterSW2_Core.
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW2_Core
PiterSW2_Core(config)#vlan 71
PiterSW2_Core(config-vlan)#name Dir
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 77
PiterSW2_Core(config-vlan)#name Zam
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 112
PiterSW2_Core(config-vlan)#name secret
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 999
PiterSW2_Core(config-vlan)#name Native
PiterSW2_Core(config-vlan)#
PiterSW2_Core#write memory
```
![[03_Лабораторная работа 3. STP-16.10.2025-20_26.png]]
Коммутатор PiterSW1_ACS
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW1_ACS
PiterSW1_ACS(config)#vlan 71
PiterSW1_ACS(config-vlan)#name Dir
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 77
PiterSW1_ACS(config-vlan)#name Zam
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 112
PiterSW1_ACS(config-vlan)#name secret
*Oct 16 17:34:39.164: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
PiterSW1_ACS(config-vlan)#name secret
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 999
PiterSW1_ACS(config-vlan)#name Native
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#exit
PiterSW1_ACS#
*Oct 16 17:35:20.906: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#write memory
```
![[03_Лабораторная работа 3. STP-16.10.2025-20_36.png]]
Коммутатор PiterSW2_ACS
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW2_ACS
PiterSW2_ACS(config)#vlan 71
PiterSW2_ACS(config-vlan)#name Dir
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 77
PiterSW2_ACS(config-vlan)#name Zam
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 112
PiterSW2_ACS(config-vlan)#name secret
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 999
PiterSW2_ACS(config-vlan)#name Native
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#exit
PiterSW2_ACS#
*Oct 16 17:40:05.211: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#write memory

```
![[03_Лабораторная работа 3. STP-16.10.2025-20_40.png]]

# Шаг 2. Настройка ПК
![[03_Лабораторная работа 3. STP-16.10.2025-20_44.png]]

