![[03_Лабораторная работа 3. STP-16.10.2025-21_51.png]]
Схема сети 
## Шаг 1. Создание VLAN на коммутаторах в Питере
Коммутатор PiterSW1_core:
```
PiterSW1_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_Core(config)#vlan 71
PiterSW1_Core(config-vlan)#name Dir
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 77
PiterSW1_Core(config-vlan)#name Zam
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 112
PiterSW1_Core(config-vlan)#name Secret
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#vlan 999
PiterSW1_Core(config-vlan)#name Native
PiterSW1_Core(config-vlan)#ex
PiterSW1_Core(config)#ex
% Ambiguous command:  "ex"
PiterSW1_Core(config)#exit
PiterSW1_Core#
*Oct 16 17:06:35.209: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#write memory
Building configuration...
Compressed configuration from 808 bytes to 559 bytes[OK]
PiterSW1_Core#
```
![[03_Лабораторная работа 3. STP-16.10.2025-21_57.png]]
Все те же самые команды прописываю на коммутаторе PiterSW2_Core.
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW2_Core
PiterSW2_Core(config)#vlan 71
PiterSW2_Core(config-vlan)#name Dir
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 77
PiterSW2_Core(config-vlan)#name Zam
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 112
PiterSW2_Core(config-vlan)#name Secret
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#vlan 999
PiterSW2_Core(config-vlan)#name Native
PiterSW2_Core(config-vlan)#ex
PiterSW2_Core(config)#exit
PiterSW2_Core#
*Oct 16 18:58:56.428: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_Core#wr mem

```
![[03_Лабораторная работа 3. STP-16.10.2025-22_02.png]]
Коммутатор PiterSW1_ACS
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW1_ACS
PiterSW1_ACS(config)#vlan 71
PiterSW1_ACS(config-vlan)#name Dir
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 77
PiterSW1_ACS(config-vlan)#name Zam
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 112
PiterSW1_ACS(config-vlan)#name secret
*Oct 16 17:34:39.164: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
PiterSW1_ACS(config-vlan)#name Secret
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#vlan 999
PiterSW1_ACS(config-vlan)#name Native
PiterSW1_ACS(config-vlan)#ex
PiterSW1_ACS(config)#exit
PiterSW1_ACS#
*Oct 16 17:35:20.906: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_ACS#write memory
```
![[03_Лабораторная работа 3. STP-16.10.2025-22_05.png]]
Коммутатор PiterSW2_ACS
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname PiterSW2_ACS
PiterSW2_ACS(config)#vlan 71
PiterSW2_ACS(config-vlan)#name Dir
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 77
PiterSW2_ACS(config-vlan)#name Zam
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 112
PiterSW2_ACS(config-vlan)#name secret
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#vlan 999
PiterSW2_ACS(config-vlan)#name Native
PiterSW2_ACS(config-vlan)#ex
PiterSW2_ACS(config)#exit
PiterSW2_ACS#
*Oct 16 17:40:05.211: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_ACS#write memory

```
![[03_Лабораторная работа 3. STP-16.10.2025-22_09.png]]

# Шаг 2. Настройка ПК
VPC71_1
![[03_Лабораторная работа 3. STP-16.10.2025-22_12.png]]
VPC71_2
![[03_Лабораторная работа 3. STP-16.10.2025-22_13.png]]
VPC77_1
![[03_Лабораторная работа 3. STP-16.10.2025-22_15.png]]
VPC77_2
![[03_Лабораторная работа 3. STP-16.10.2025-22_16.png]]

# Шаг 3. Присвоение VLAN на каждом порту коммутаторов доступа
Настройка PiterSW1_ACS
```
PiterSW1_ACS>en
PiterSW1_ACS#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW1_ACS(config)#interface e0/2
PiterSW1_ACS(config-if)#switchport mode access
PiterSW1_ACS(config-if)#switchport access vlan 71
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#no shutdown
PiterSW1_ACS(config-if)#exit
PiterSW1_ACS(config)#interface e0/3
PiterSW1_ACS(config-if)#switchport mode access
PiterSW1_ACS(config-if)#switchport access vlan 112
PiterSW1_ACS(config-if)#switchport nonegotiate
PiterSW1_ACS(config-if)#no shutdown
PiterSW1_ACS(config-if)#exit
```
![[03_Лабораторная работа 3. STP-16.10.2025-22_30.png]]

Настройка PiterSW2_ACS
```
PiterSW2_ACS>en
PiterSW2_ACS#conf t
PiterSW2_ACS(config)#interface e0/2
PiterSW2_ACS(config-if)#switchport mode access
PiterSW2_ACS(config-if)#switchport access vlan 77

PiterSW2_ACS(config-if)#no shutdown
PiterSW2_ACS(config-if)#exit
PiterSW2_ACS(config)#interface e0/3
PiterSW2_ACS(config-if)#switchport mode access
PiterSW2_ACS(config-if)#switchport access vlan 112
PiterSW2_ACS(config-if)#no shutdown
PiterSW2_ACS(config-if)#exit
```
![[03_Лабораторная работа 3. STP-16.10.2025-21_03.png]]
Настройка Trunk на коммутаторах 
PiterSW2_ACS
```
PiterSW2_ACS(config)#interface range e0/0-1
PiterSW2_ACS(config-if-range)#switchport trunk encapsulation dot1q
PiterSW2_ACS(config-if-range)# switchport mode trunk
PiterSW2_ACS(config-if-range)# switchport trunk native vlan 999
PiterSW2_ACS(config-if-range)# switchport trunk allowed vlan 71,77,112,999
PiterSW2_ACS(config-if-range)#exit
```
PiterSW1_ACS
```
PiterSW1_ACS(config)#interface range e0/0-1
PiterSW1_ACS(config-if-range)#switchport trunk encapsulation dot1q
PiterSW1_ACS(config-if-range)# switchport mode trunk
PiterSW1_ACS(config-if-range)# switchport trunk native vlan 999
PiterSW1_ACS(config-if-range)# switchport trunk allowed vlan 71,77,112,999
PiterSW1_ACS(config-if-range)#exit
```

