![[04_Лабораторная работа 4. OSPF+Static-18.10.2025-17_58.png]]
Обновленная схема сети
# Настройка статической маршрутизации
```
Router#conf t
Piter_RTR1(config)#interface Ethernet0/1
Piter_RTR1(config-if)#ip address 10.0.0.1 255.255.255.252
Piter_RTR1(config-if)#no shutdown
Piter_RTR1(config-if)#ex
Piter_RTR1(config)#ip route 172.18.77.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#ip route 172.18.112.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#interface e0/0
Piter_RTR1(config-if)#no ip address
Piter_RTR1(config-if)#ip address 10.0.0.5 255.255.255.252
Piter_RTR1(config-if)#no shutdown
Piter_RTR1(config-if)#ex
Piter_RTR1(config)#ip route 172.18.71.0 255.255.255.240 10.0.0.6
```
```
PiterSW1_Core(config)#interface Ethernet1/0
PiterSW1_Core(config-if)#no switchport
PiterSW1_Core(config-if)#ip address 10.0.0.6 255.255.255.252
PiterSW1_Core(config-if)#no shutdown
```
```
PiterSW2_Core(config)#int e1/0
PiterSW2_Core(config-if)#no switchport
PiterSW2_Core(config-if)#ip address 10.0.0.2 255.255.255.252
PiterSW2_Core(config-if)#no shutdown
```
![[04_Лабораторная работа 4. OSPF+Static-18.10.2025-20_26.png]]
![[04_Лабораторная работа 4. OSPF+Static-18.10.2025-21_47.png]]![[04_Лабораторная работа 4. OSPF+Static-18.10.2025-21_47-1.png]]

# Настройка VIP
![[04_Лабораторная работа 4. OSPF+Static-18.10.2025-21_56.png]]
Настраиваю ip на vpc_vip

---
Настройка SW_VIP
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW_VIP
SW_VIP(config)#vlan 777
SW_VIP(config-vlan)#name VIP
SW_VIP(config-vlan)#ex
SW_VIP(config)#int e0/0
SW_VIP(config-if)#switchport mode access
SW_VIP(config-if)#switchport access vlan 777
SW_VIP(config-if)#switchport nonegotiate
SW_VIP(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on Ethernet0/0 but will only
 have effect when the interface is in a non-trunking mode.
SW_VIP(config-if)#ex
SW_VIP(config)#int e0/1
SW_VIP(config-if)#switchport mode trunk
Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
SW_VIP(config-if)#switchport trunk encapsulation dot1q
SW_VIP(config-if)#switchport mode trunk
SW_VIP(config-if)#
*Oct 18 19:17:43.685: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, changed state to down
SW_VIP(config-if)#
*Oct 18 19:17:46.689: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, changed state to up
SW_VIP(config-if)#switchport trunk allowed vlan 777
SW_VIP(config-if)#switchport trunk native vlan 999
SW_VIP(config-if)#switchport nonegotiate
SW_VIP(config-if)#
*Oct 18 19:18:08.050: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
SW_VIP(config-if)#exit
SW_VIP(config)#

```
---
Настройка Kzn_RTR1


```

```
