![[04_Лабораторная работа 4. OSPF+Static-18.10.2025-17_58.png]]
Обновленная схема сети
# Настройка статической маршрутизации
```
Router#conf t
Piter_RTR1(config)#interface Ethernet0/1
Piter_RTR1(config-if)#ip address 10.0.0.1 255.255.255.252
Piter_RTR1(config-if)#no shutdown
Piter_RTR1(config-if)#ex
Piter_RTR1(config)#ip route 172.18.77.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#ip route 172.18.112.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#interface e0/0
Piter_RTR1(config-if)#no ip address
Piter_RTR1(config-if)#ip address 10.0.0.5 255.255.255.252
Piter_RTR1(config-if)#no shutdown
Piter_RTR1(config-if)#ex
Piter_RTR1(config)#ip route 172.18.71.0 255.255.255.240 10.0.0.6
```
```
PiterSW1_Core(config)#interface Ethernet1/0
PiterSW1_Core(config-if)#no switchport
PiterSW1_Core(config-if)#ip address 10.0.0.6 255.255.255.252
PiterSW1_Core(config-if)#no shutdown
```
```
PiterSW2_Core(config)#int e1/0
PiterSW2_Core(config-if)#no switchport
PiterSW2_Core(config-if)#ip address 10.0.0.2 255.255.255.252
PiterSW2_Core(config-if)#no shutdown
```
![[04_Лабораторная работа 4. OSPF+Static-18.10.2025-20_26.png]]
![[04_Лабораторная работа 4. OSPF+Static-18.10.2025-21_47.png]]![[04_Лабораторная работа 4. OSPF+Static-18.10.2025-21_47-1.png]]

# Настройка VIP
![[04_Лабораторная работа 4. OSPF+Static-18.10.2025-21_56.png]]
Настраиваю ip на vpc_vip

---
Настройка SW_VIP
```
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SW_VIP
SW_VIP(config)#vlan 777
SW_VIP(config-vlan)# name VIP_VLAN
SW_VIP(config-vlan)# exit
SW_VIP(config)#int e0/1
SW_VIP(config-if)#switchport mode access
SW_VIP(config-if)# switchport access vlan 777
SW_VIP(config-if)# no shutdown
SW_VIP(config-if)# exit
SW_VIP(config)#int e0/0
SW_VIP(config-if)#switchport mode access
SW_VIP(config-if)# switchport access vlan 777
SW_VIP(config-if)# no shutdown
SW_VIP(config-if)# exit
SW_VIP(config)#
SW_VIP(config)#
SW_VIP(config)#interface range ethernet0/2-3
SW_VIP(config-if-range)# shutdown
SW_VIP(config-if-range)# exit
SW_VIP(config)#
*Oct 19 08:43:51.791: %LINK-5-CHANGED: Interface Ethernet0/2, changed state to administratively down
*Oct 19 08:43:51.800: %LINK-5-CHANGED: Interface Ethernet0/3, changed state to administratively down
*Oct 19 08:43:52.798: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/2, changed state to down
*Oct 19 08:43:52.804: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/3, changed state to down
SW_VIP(config)#end
SW_VIP#
*Oct 19 08:43:57.336: %SYS-5-CONFIG_I: Configured from console by console
SW_VIP#wr mem
Building configuration...

```
---
Настройка Kzn_RTR2
```
Router(config)#int e0/1
Router(config-if)#no switchport
Router(config-if)# ip address 10.10.77.1 255.255.255.0
Router(config-if)# no shutdown
Router(config-if)# exit
*Oct 19 08:45:43.069: %LINK-3-UPDOWN: Interface Ethernet0/1, changed state to up
*Oct 19 08:45:44.077: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, changed state to up
Router(config-if)# exit
Router(config)#end
Router#
*Oct 19 08:45:49.677: %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
Building configuration...

```
![[04_Лабораторная работа 4. OSPF+Static-19.10.2025-11_47.png]]

# Настройка OSPF
Kzn_RTR1
```
Router(config)#hostname Kzn_RTR1
Kzn_RTR1(config)#router ospf 1
Kzn_RTR1(config-router)# router-id 1.1.1.1
Kzn_RTR1(config-router)# network 0.0.0.0 255.255.255.255 area 0
Kzn_RTR1(config-router)# exit
Kzn_RTR1(config)#int range e0/0-1
Kzn_RTR1(config-if-range)#ip ospf priority 255
Kzn_RTR1(config-if-range)# ip ospf network broadcast
Kzn_RTR1(config-if-range)# exit
Kzn_RTR1(config)#end
Kzn_RTR1#wr
*Oct 19 09:09:18.467: %SYS-5-CONFIG_I: Configured from console by console
Kzn_RTR1#wr mem
Building configuration...
[OK]
```

Kzn_RTR2
```
Kzn_RTR2>en
Kzn_RTR2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR2(config)#router ospf 1
Kzn_RTR2(config-router)# router-id 2.2.2.2
Kzn_RTR2(config-router)# network 0.0.0.0 255.255.255.255 area 0
Kzn_RTR2(config-router)# exit
Kzn_RTR2(config)#int range e0/0-1
Kzn_RTR2(config-if-range)#ip ospf priority 0
Kzn_RTR2(config-if-range)# ip ospf network broadcast
Kzn_RTR2(config-if-range)# exit
Kzn_RTR2(config)#
Kzn_RTR2#wr mem
*Oct 19 09:13:33.441: %SYS-5-CONFIG_I: Configured from console by console
Kzn_RTR2#wr mem
Building configuration...
[OK]
```

```
KznSW2_Core(config)#router ospf 1
KznSW2_Core(config-router)# router-id 4.4.4.4
KznSW2_Core(config-router)# network 0.0.0.0 255.255.255.255 area 0
KznSW2_Core(config-router)# exit
KznSW2_Core(config)#int e0/3
KznSW2_Core(config-if)# ip ospf priority 50
KznSW2_Core(config-if)# ip ospf network broadcast
KznSW2_Core(config-if)# exit
KznSW2_Core(config)#end
```

```
KznSW1_Core(config)#router ospf 1
KznSW1_Core(config-router)# router-id 3.3.3.3
KznSW1_Core(config-router)# network 0.0.0.0 255.255.255.255 area 0
KznSW1_Core(config-router)# exit
KznSW1_Core(config)#
*Oct 19 10:07:16.317: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Config Wizard)
KznSW1_Core(config)#int e0/3
KznSW1_Core(config-if)#ip ospf priority 50
KznSW1_Core(config-if)# ip ospf network broadcast
KznSW1_Core(config-if)# exit
KznSW1_Core(config)#end
KznSW1_Core#wr
```

# Настройка Md5 и пароля
```
Kzn_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR1(config)#interface ethernet0/1
Kzn_RTR1(config-if)# ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR1(config-if)# ip ospf authentication message-digest
Kzn_RTR1(config-if)# exit
Kzn_RTR1(config)#interface e0/0
Kzn_RTR1(config-if)# ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR1(config-if)# ip ospf authentication message-digest
Kzn_RTR1(config-if)# exit
Kzn_RTR1(config)#end
Kzn_RTR1#write memory
Building configuration...
[OK]
```
```
Kzn_RTR2#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR2(config)#interface ethernet0/0
Kzn_RTR2(config-if)# ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR2(config-if)# ip ospf authentication message-digest
Kzn_RTR2(config-if)# exit
Kzn_RTR2(config)#interface ethernet0/1
Kzn_RTR2(config-if)#ip ospf message-digest-key 1 md5 PROTECH
Kzn_RTR2(config-if)# ip ospf authentication message-digest
Kzn_RTR2(config-if)# exit
Kzn_RTR2(config)#end
Kzn_RTR2#wr mem
Building configuration...
[OK]
```