![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/05_%D0%9B%D0%B0%D0%B1%D0%BE%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%205.%20BGP-19.10.2025-18_15.png?raw=true)
Топология
Приступлю к настройке BGP
Настройка BGP и анонса маршрута на RTR 
```
Switch(config)#hostname RTR
RTR(config)#ip routing
RTR(config)#interface ethernet0/0
RTR(config-if)# no switchport
RTR(config-if)# ip address 10.0.10.1 255.255.255.252
RTR(config-if)# no shutdown
RTR(config-if)# exit
RTR(config)#
*Oct 19 16:19:41.124: %LINK-3-UPDOWN: Interface Ethernet0/0, changed state to up
*Oct 19 16:19:42.129: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to up
RTR(config)#interface ethernet0/1
RTR(config-if)# no switchport
RTR(config-if)# ip address 10.0.20.1 255.255.255.252
RTR(config-if)# no shutdown
RTR(config-if)# exit
RTR(config)#
*Oct 19 16:19:46.675: %LINK-3-UPDOWN: Interface Ethernet0/1, changed state to up
*Oct 19 16:19:47.675: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, changed state to up
RTR(config)#router bgp 200
RTR(config-router)# bgp router-id 10.10.10.10
RTR(config-router)# bgp log-neighbor-changes
RTR(config-router)# neighbor 10.0.10.2 remote-as 201
RTR(config-router)# neighbor 10.0.10.2 description Piter_RTR1
RTR(config-router)# neighbor 10.0.10.2 password PROTECH
RTR(config-router)# neighbor 10.0.20.2 remote-as 202
RTR(config-router)# neighbor 10.0.20.2 description Kzn_RTR1
RTR(config-router)# neighbor 10.0.20.2 password PROTECH
RTR(config-router)#network 10.0.10.0 mask 255.255.255.252
RTR(config-router)# network 10.0.20.0 mask 255.255.255.252
RTR(config-router)# exit
RTR(config)#end
RTR#write memory
Building configuration...
Compressed configuration from 1260 bytes to 801 bytes[OK]
RTR#
```
![[05_Лабораторная работа 5. BGP-19.10.2025-18_33.png]]
Настройка на Piter_RTR1
```
Piter_RTR1>en
Piter_RTR1>en
Piter_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Piter_RTR1(config)#interface ethernet0/2
Piter_RTR1(config-if)# ip address 10.0.10.2 255.255.255.252
Piter_RTR1(config-if)# no shutdown
Piter_RTR1(config-if)# exit
Piter_RTR1(config)#
*Oct 19 16:22:14.283: %LINK-3-UPDOWN: Interface Ethernet0/2, changed state to up
*Oct 19 16:22:15.288: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/2, changed state to up
Piter_RTR1(config)#no router ospf 1
Piter_RTR1(config)#router bgp 201
Piter_RTR1(config-router)# bgp router-id 5.5.5.5
Piter_RTR1(config-router)# bgp log-neighbor-changes
Piter_RTR1(config-router)# neighbor 10.0.10.1 remote-as 200
Piter_RTR1(config-router)# neighbor 10.0.10.1 description RTR
Piter_RTR1(config-router)# neighbor 10.0.10.1 password PROTECH
Piter_RTR1(config-router)# network 10.0.0.0 mask 255.255.255.252
Piter_RTR1(config-router)# network 10.0.0.4 mask 255.255.255.252
Piter_RTR1(config-router)# network 172.18.71.0 mask 255.255.255.240
Piter_RTR1(config-router)# network 172.18.77.0 mask 255.255.255.240
Piter_RTR1(config-router)# network 172.18.112.0 mask 255.255.255.240
Piter_RTR1(config-router)# exit
*Oct 19 16:22:45.668: %BGP-5-ADJCHANGE: neighbor 10.0.10.1 Up
Piter_RTR1(config-router)# exit
Piter_RTR1(config)#ip route 172.18.71.0 255.255.255.240 10.0.0.6
Piter_RTR1(config)#ip route 172.18.77.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#ip route 172.18.112.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#
Piter_RTR1(config)#end
Piter_RTR1#write memory
Building configuration...
[OK]
Piter_RTR1#

```

![[05_Лабораторная работа 5. BGP-19.10.2025-18_35.png]]
Настройка на Kzn_RTR1
```
Kzn_RTR1>en
Kzn_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR1(config)#interface ethernet0/3
Kzn_RTR1(config-if)# ip address 10.0.20.2 255.255.255.252
Kzn_RTR1(config-if)# no shutdown
Kzn_RTR1(config-if)# exit
Kzn_RTR1(config)#
*Oct 19 16:24:46.013: %LINK-3-UPDOWN: Interface Ethernet0/3, changed state to up
*Oct 19 16:24:47.017: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/3, changed state to up
Kzn_RTR1(config)#router bgp 202
Kzn_RTR1(config-router)# bgp router-id 1.1.1.1
Kzn_RTR1(config-router)# bgp log-neighbor-changes
Kzn_RTR1(config-router)# neighbor 10.0.20.1 remote-as 200
Kzn_RTR1(config-router)# neighbor 10.0.20.1 description RTR
Kzn_RTR1(config-router)# neighbor 10.0.20.1 password PROTECH
Kzn_RTR1(config-router)#
*Oct 19 16:25:07.496: %BGP-5-ADJCHANGE: neighbor 10.0.20.1 Up
Kzn_RTR1(config-router)# network 10.0.1.0 mask 255.255.255.252
Kzn_RTR1(config-router)# network 10.0.2.0 mask 255.255.255.252
Kzn_RTR1(config-router)# network 10.0.3.0 mask 255.255.255.252
Kzn_RTR1(config-router)# network 10.10.4.0 mask 255.255.255.0
Kzn_RTR1(config-router)# network 10.10.71.0 mask 255.255.255.0
Kzn_RTR1(config-router)# network 10.10.77.0 mask 255.255.255.0
Kzn_RTR1(config-router)# network 10.10.84.16 mask 255.255.255.240
Kzn_RTR1(config-router)# network 10.10.86.0 mask 255.255.255.224
Kzn_RTR1(config-router)# redistribute ospf 1
Kzn_RTR1(config-router)# exit
Kzn_RTR1(config)#router ospf 1
Kzn_RTR1(config-router)# router-id 1.1.1.1
Kzn_RTR1(config-router)# network 10.0.1.0 0.0.0.3 area 0
Kzn_RTR1(config-router)# network 10.0.2.0 0.0.0.3 area 0
Kzn_RTR1(config-router)# network 10.0.3.0 0.0.0.3 area 0
Kzn_RTR1(config-router)# passive-interface ethernet0/3
Kzn_RTR1(config-router)# redistribute bgp 202 subnets
Kzn_RTR1(config-router)# exit
Kzn_RTR1(config)#interface ethernet0/0
Kzn_RTR1(config-if)# ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/0: Key 1 already exists
Kzn_RTR1(config-if)# ip ospf authentication message-digest
Kzn_RTR1(config-if)# ip ospf priority 255
Kzn_RTR1(config-if)# ip ospf network point-to-point
Kzn_RTR1(config-if)# exit
Kzn_RTR1(config)#interface ethernet0/1
Kzn_RTR1(config-if)# ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/1: Key 1 already exists
Kzn_RTR1(config-if)# ip ospf authentication message-digest
Kzn_RTR1(config-if)# ip ospf priority 255
Kzn_RTR1(config-if)# ip ospf network point-to-point
Kzn_RTR1(config-if)# exit
Kzn_RTR1(config)#
Kzn_RTR1(config)#
Kzn_RTR1(config)#interface ethernet0/2
Kzn_RTR1(config-if)# ip ospf message-digest-key 1 md5 PROTECH
% OSPF Ethernet0/2: Key 1 already exists
Kzn_RTR1(config-if)# ip ospf authentication message-digest
Kzn_RTR1(config-if)# ip ospf priority 255
Kzn_RTR1(config-if)# ip ospf network point-to-point
Kzn_RTR1(config-if)# exit
Kzn_RTR1(config)#end
Kzn_RTR1#write memory
Building configuration...
[OK]

```
![[05_Лабораторная работа 5. BGP-19.10.2025-18_36-1.png]]


---

Добавляем маршруты на pitersw1_core и pitersw2_core
```
PiterSW2_Core#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
PiterSW2_Core(config)#ip route 10.10.0.0 255.255.0.0 10.0.0.5
PiterSW2_Core(config)#ip route 10.0.10.0 255.255.255.252 10.0.0.5
PiterSW2_Core(config)#ip route 10.0.20.0 255.255.255.252 10.0.0.5
PiterSW2_Core(config)#end
PiterSW2_Core#wr
*Oct 20 07:52:58.689: %SYS-5-CONFIG_I: Configured from console by console
PiterSW2_Core#wr mem
Building configuration...
Compressed configuration from 2236 bytes to 1173 bytes[OK]
PiterSW2_Core#ping 10.10.86.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.10.86.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/2 ms
PiterSW2_Core#
```

```
PiterSW1_Core(config)#ip route 10.10.0.0 255.255.0.0 10.0.0.5
PiterSW1_Core(config)#ip route 10.0.10.0 255.255.255.252 10.0.0.5
PiterSW1_Core(config)#ip route 10.0.20.0 255.255.255.252 10.0.0.5
PiterSW1_Core(config)#end
PiterSW1_Core#write memory
Building configuration...
Compressed configuration from 2174 bytes to 1160 bytes[OK]
PiterSW1_Core#
*Oct 20 07:51:05.187: %SYS-5-CONFIG_I: Configured from console by console
PiterSW1_Core#ping 10.0.10.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.0.10.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
PiterSW1_Core#ping 10.10.86.2
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 10.10.86.2, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/3 ms
PiterSW1_Core#


```
Проверка работоспособность 
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/05_%D0%9B%D0%B0%D0%B1%D0%BE%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%205.%20BGP-19.10.2025-18_37.png?raw=true)
