![[05_Лабораторная работа 5. BGP-19.10.2025-18_15.png]]
Топология
Приступлю к настройке BGP
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname RTR
RTR(config)#router bgp 200
RTR(config-router)#
*Oct 19 15:18:31.363: %BGP-4-NORTRID: BGP could not pick a router-id. Please configure manually.
RTR(config-router)#neighbor 10.0.0.5 remote-as 201
RTR(config-router)#neighbor 10.0.0.1 remote-as 202
RTR(config-router)#neighbor 10.0.0.5 update-source Ethernet0/0
RTR(config-router)#neighbor 10.0.0.1 update-source Ethernet0/1
RTR(config-router)#ex

```

```
Piter_RTR1>en
Piter_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Piter_RTR1(config)#router bgp 201
Piter_RTR1(config-router)#neighbor 10.0.0.6 remote-as 200
Piter_RTR1(config-router)#neighbor 10.0.0.6 update-source Ethernet0/2
Piter_RTR1(config-router)#network 172.18.71.0 mask 255.255.255.240
Piter_RTR1(config-router)#network 172.18.77.0 mask 255.255.255.240
Piter_RTR1(config-router)#network 172.18.112.0 mask 255.255.255.240
Piter_RTR1(config-router)#ex
Piter_RTR1(config)#
```

```
Piter_RTR1>en
Piter_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Piter_RTR1(config)#router bgp 201
Piter_RTR1(config-router)#neighbor 10.0.0.6 remote-as 200
Piter_RTR1(config-router)#neighbor 10.0.0.6 update-source Ethernet0/2
Piter_RTR1(config-router)#network 172.18.71.0 mask 255.255.255.240
Piter_RTR1(config-router)#network 172.18.77.0 mask 255.255.255.240
Piter_RTR1(config-router)#network 172.18.112.0 mask 255.255.255.240
Piter_RTR1(config-router)#ex
Piter_RTR1(config)#
```

```
Kzn_RTR1>en
Kzn_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR1(config)#router bgp 202
Kzn_RTR1(config-router)#neighbor 10.0.0.2 remote-as 200
Kzn_RTR1(config-router)#neighbor 10.0.0.2 update-source Ethernet0/3
Kzn_RTR1(config-router)#network 10.10.4.0 mask 255.255.255.0
Kzn_RTR1(config-router)#network 10.10.71.0 mask 255.255.255.0
Kzn_RTR1(config-router)#network 10.10.84.16 mask 255.255.255.240
Kzn_RTR1(config-router)#network 10.10.86.0 mask 255.255.255.224
Kzn_RTR1(config-router)#exit
Kzn_RTR1(config)#
```
