![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/05_%D0%9B%D0%B0%D0%B1%D0%BE%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%205.%20BGP-19.10.2025-18_15.png?raw=true)
Топология
Приступлю к настройке BGP
Настройка BGP и анонса маршрута на RTR 
```
Switch(config)#hostname RTR
RTR(config)#ip routing
RTR(config)#interface ethernet0/0
RTR(config-if)# no switchport
RTR(config-if)# ip address 10.0.10.1 255.255.255.252
RTR(config-if)# no shutdown
RTR(config-if)# exit
RTR(config)#
*Oct 20 07:19:41.124: %LINK-3-UPDOWN: Interface Ethernet0/0, changed state to up
*Oct 20 07:19:42.129: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/0, changed state to up
RTR(config)#interface ethernet0/1
RTR(config-if)# no switchport
RTR(config-if)# ip address 10.0.20.1 255.255.255.252
RTR(config-if)# no shutdown
RTR(config-if)# exit
RTR(config)#
*Oct 20 07:19:46.675: %LINK-3-UPDOWN: Interface Ethernet0/1, changed state to up
*Oct 20 07:19:47.675: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/1, changed state to up
RTR(config)#router bgp 200
RTR(config-router)# bgp router-id 10.10.10.10
RTR(config-router)# bgp log-neighbor-changes
RTR(config-router)# neighbor 10.0.10.2 remote-as 201
RTR(config-router)# neighbor 10.0.10.2 description Piter_RTR1
RTR(config-router)# neighbor 10.0.10.2 password PROTECH
RTR(config-router)# neighbor 10.0.20.2 remote-as 202
RTR(config-router)# neighbor 10.0.20.2 description Kzn_RTR1
RTR(config-router)# neighbor 10.0.20.2 password PROTECH
RTR(config-router)#network 10.0.10.0 mask 255.255.255.252
RTR(config-router)# network 10.0.20.0 mask 255.255.255.252
RTR(config-router)# exit
RTR(config)#end
RTR#write memory
Building configuration...
Compressed configuration from 1260 bytes to 801 bytes[OK]
RTR#


```
Настройка на Piter_RTR1
```
Piter_RTR1>en
Piter_RTR1>en
Piter_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Piter_RTR1(config)#interface ethernet0/2
Piter_RTR1(config-if)# ip address 10.0.10.2 255.255.255.252
Piter_RTR1(config-if)# no shutdown
Piter_RTR1(config-if)# exit
Piter_RTR1(config)#
*Oct 20 07:22:14.283: %LINK-3-UPDOWN: Interface Ethernet0/2, changed state to up
*Oct 20 07:22:15.288: %LINEPROTO-5-UPDOWN: Line protocol on Interface Ethernet0/2, changed state to up
Piter_RTR1(config)#no router ospf 1
Piter_RTR1(config)#router bgp 201
Piter_RTR1(config-router)# bgp router-id 5.5.5.5
Piter_RTR1(config-router)# bgp log-neighbor-changes
Piter_RTR1(config-router)# neighbor 10.0.10.1 remote-as 200
Piter_RTR1(config-router)# neighbor 10.0.10.1 description RTR
Piter_RTR1(config-router)# neighbor 10.0.10.1 password PROTECH
Piter_RTR1(config-router)# network 10.0.0.0 mask 255.255.255.252
Piter_RTR1(config-router)# network 10.0.0.4 mask 255.255.255.252
Piter_RTR1(config-router)# network 172.18.71.0 mask 255.255.255.240
Piter_RTR1(config-router)# network 172.18.77.0 mask 255.255.255.240
Piter_RTR1(config-router)# network 172.18.112.0 mask 255.255.255.240
Piter_RTR1(config-router)# exit
*Oct 20 07:22:45.668: %BGP-5-ADJCHANGE: neighbor 10.0.10.1 Up
Piter_RTR1(config-router)# exit
Piter_RTR1(config)#ip route 172.18.71.0 255.255.255.240 10.0.0.6
Piter_RTR1(config)#ip route 172.18.77.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#ip route 172.18.112.0 255.255.255.240 10.0.0.2
Piter_RTR1(config)#
Piter_RTR1(config)#end
Piter_RTR1#write memory
Building configuration...
[OK]
Piter_RTR1#

```
Настройка на Kzn_RTR1
```
Kzn_RTR1>en
Kzn_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR1(config)#router bgp 202
Kzn_RTR1(config-router)#neighbor 10.0.0.2 remote-as 200
Kzn_RTR1(config-router)#neighbor 10.0.0.2 update-source Ethernet0/3
Kzn_RTR1(config-router)#network 10.10.4.0 mask 255.255.255.0
Kzn_RTR1(config-router)#network 10.10.71.0 mask 255.255.255.0
Kzn_RTR1(config-router)#network 10.10.84.16 mask 255.255.255.240
Kzn_RTR1(config-router)#network 10.10.86.0 mask 255.255.255.224
Kzn_RTR1(config-router)#exit
Kzn_RTR1(config)#
```
---
Добавляю routter id
```
RTR(config)#interface loopback0
RTR(config-if)#
*Oct 19 15:31:31.999: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
RTR(config-if)#ip address 5.5.5.5 255.255.255.255
RTR(config-if)#ex
RTR#clear ip bgp *
RTR#
*Oct 19 15:31:54.962: %SYS-5-CONFIG_I: Configured from console by console
RTR#
*Oct 19 15:31:56.132: %BGP-3-NOTIFICATION_MANY: sent to 2 sessions 6/4 (Administrative Reset) for all peers
RTR#show ip bgp summary
BGP router identifier 5.5.5.5, local AS number 200
BGP table version is 1, main routing table version 1

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.0.0.1        4          202       0       0        1    0    0 never    Idle
10.0.0.5        4          201       0       0        1    0    0 never    Idle
RTR#

```
---

```
RTR(config)#router bgp 200
RTR(config-router)#neighbor 10.0.0.5 default-originate
RTR(config-router)#neighbor 10.0.0.1 default-originate
RTR(config-router)#exit

```
Проверка работоспособность 
![Image](https://github.com/sender2033/testwork-protech-Vafin/blob/main/Image/05_%D0%9B%D0%B0%D0%B1%D0%BE%D1%80%D0%B0%D1%82%D0%BE%D1%80%D0%BD%D0%B0%D1%8F%20%D1%80%D0%B0%D0%B1%D0%BE%D1%82%D0%B0%205.%20BGP-19.10.2025-18_37.png?raw=true)
