![[05_Лабораторная работа 5. BGP-19.10.2025-18_15.png]]
Топология
Приступлю к настройке BGP
Настройка BGP на RTR
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname RTR
RTR(config)#router bgp 200
RTR(config-router)#
*Oct 19 15:18:31.363: %BGP-4-NORTRID: BGP could not pick a router-id. Please configure manually.
RTR(config-router)#neighbor 10.0.0.5 remote-as 201
RTR(config-router)#neighbor 10.0.0.1 remote-as 202
RTR(config-router)#neighbor 10.0.0.5 update-source Ethernet0/0
RTR(config-router)#neighbor 10.0.0.1 update-source Ethernet0/1
RTR(config-router)#ex

```
Настройка на Piter_RTR1
```
Piter_RTR1>en
Piter_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Piter_RTR1(config)#router bgp 201
Piter_RTR1(config-router)#neighbor 10.0.0.6 remote-as 200
Piter_RTR1(config-router)#neighbor 10.0.0.6 update-source Ethernet0/2
Piter_RTR1(config-router)#network 172.18.71.0 mask 255.255.255.240
Piter_RTR1(config-router)#network 172.18.77.0 mask 255.255.255.240
Piter_RTR1(config-router)#network 172.18.112.0 mask 255.255.255.240
Piter_RTR1(config-router)#ex
Piter_RTR1(config)#
```
Настройка на Kzn_RTR1
```
Kzn_RTR1>en
Kzn_RTR1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Kzn_RTR1(config)#router bgp 202
Kzn_RTR1(config-router)#neighbor 10.0.0.2 remote-as 200
Kzn_RTR1(config-router)#neighbor 10.0.0.2 update-source Ethernet0/3
Kzn_RTR1(config-router)#network 10.10.4.0 mask 255.255.255.0
Kzn_RTR1(config-router)#network 10.10.71.0 mask 255.255.255.0
Kzn_RTR1(config-router)#network 10.10.84.16 mask 255.255.255.240
Kzn_RTR1(config-router)#network 10.10.86.0 mask 255.255.255.224
Kzn_RTR1(config-router)#exit
Kzn_RTR1(config)#
```
---
Добавляю routter id
```
RTR(config)#interface loopback0
RTR(config-if)#
*Oct 19 15:31:31.999: %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
RTR(config-if)#ip address 5.5.5.5 255.255.255.255
RTR(config-if)#ex
RTR#clear ip bgp *
RTR#
*Oct 19 15:31:54.962: %SYS-5-CONFIG_I: Configured from console by console
RTR#
*Oct 19 15:31:56.132: %BGP-3-NOTIFICATION_MANY: sent to 2 sessions 6/4 (Administrative Reset) for all peers
RTR#show ip bgp summary
BGP router identifier 5.5.5.5, local AS number 200
BGP table version is 1, main routing table version 1

Neighbor        V           AS MsgRcvd MsgSent   TblVer  InQ OutQ Up/Down  State/PfxRcd
10.0.0.1        4          202       0       0        1    0    0 never    Idle
10.0.0.5        4          201       0       0        1    0    0 never    Idle
RTR#

```
---
Настройка анонса маршрута
```
RTR(config)#router bgp 200
RTR(config-router)#neighbor 10.0.0.5 default-originate
RTR(config-router)#neighbor 10.0.0.1 default-originate
RTR(config-router)#exit

```
Проверка работоспособность 
![[05_Лабораторная работа 5. BGP-19.10.2025-18_37.png]]
